//01. 加拿大联邦快速通道项目

//crs评分标准
var d = [{
    "title": "A. 核心评分要素 Core / human capital factors",
    "k1": "有配偶最高 460分",
    "k2": "单身最高 500分",
    "children": [{
        "title": "年龄 Age",
        "_id": 1,
        "k1": "有配偶最高100分",
        "k2": "单身最高110分",
        "list": [{
            "v1": "18周岁",
            "v2": "90",
            "v3": "99"
          },
          {
            "v1": "19周岁",
            "v2": "95",
            "v3": "105"
          },
          {
            "v1": "20 - 29周岁",
            "v2": "100",
            "v3": "110"
          },
          {
            "v1": "30周岁",
            "v2": "95",
            "v3": "105"
          },
          {
            "v1": "31周岁",
            "v2": "90",
            "v3": "99"
          },
          {
            "v1": "32周岁",
            "v2": "85",
            "v3": "94"
          },
          {
            "v1": "33周岁",
            "v2": "80",
            "v3": "88"
          },
          {
            "v1": "34周岁",
            "v2": "75",
            "v3": "83"
          },
          {
            "v1": "35周岁",
            "v2": "70",
            "v3": "77"
          },
          {
            "v1": "36周岁",
            "v2": "65",
            "v3": "72"
          },
          {
            "v1": "37周岁",
            "v2": "60",
            "v3": "66"
          },
          {
            "v1": "38周岁",
            "v2": "55",
            "v3": "61"
          },
          {
            "v1": "39周岁",
            "v2": "50",
            "v3": "55"
          },
          {
            "v1": "40周岁",
            "v2": "45",
            "v3": "50"
          },
          {
            "v1": "41周岁",
            "v2": "35",
            "v3": "39"
          },
          {
            "v1": "42周岁",
            "v2": "25",
            "v3": "28"
          },
          {
            "v1": "43周岁",
            "v2": "15",
            "v3": "17"
          },
          {
            "v1": "44周岁",
            "v2": "5",
            "v3": "6"
          },
          {
            "v1": "45周岁 or more",
            "v2": "-",
            "v3": "-"
          }
        ]
      },
      {
        "title": "教育 Level of education",
        "_id": 2,
        "k1": "有配偶最高140分",
        "k2": "单身最高150分",
        "list": [{
            "v1": "高中",
            "v2": "28",
            "v3": "30"
          },
          {
            "v1": "一年高等教育",
            "v2": "84",
            "v3": "90"
          },
          {
            "v1": "二年高等教育",
            "v2": "91",
            "v3": "98"
          },
          {
            "v1": "三年及以上高等教育",
            "v2": "112",
            "v3": "120"
          },
          {
            "v1": "两个以上高等教育且其中一个为3年制及以上",
            "v2": "119",
            "v3": "128"
          },
          {
            "v1": "硕士",
            "v2": "126",
            "v3": "135"
          },
          {
            "v1": "博士",
            "v2": "140",
            "v3": "150"
          }
        ]
      },
      {
        "title": "第一语言 Official languages proficiency - 1st official language",
        "_id": 3,
        "k1": "有配偶最高128分",
        "k2": "单身最高136分",
        "list": [{
            "v1": "Less than CLB 4",
            "v2": "0分/项",
            "v3": "0分/项"
          },
          {
            "v1": "CLB 4 or 5",
            "v2": "6分/项",
            "v3": "6分/项"
          },
          {
            "v1": "CLB 6",
            "v2": "8分/项",
            "v3": "9分/项"
          },
          {
            "v1": "CLB 7",
            "v2": "16分/项",
            "v3": "17分/项"
          },
          {
            "v1": "CLB 8",
            "v2": "22分/项",
            "v3": "23分/项"
          },
          {
            "v1": "CLB 9",
            "v2": "29分/项",
            "v3": "31分/项"
          },
          {
            "v1": "CLB 10 or more",
            "v2": "32分/项",
            "v3": "34分/项"
          }
        ]
      },
      {
        "title": "第二语言 Official languages proficiency - 2nd official language",
        "_id": 4,
        "k1": "有配偶最高22分",
        "k2": "单身最高24分",
        "list": [{
            "v1": "CLB 5 or 6",
            "v2": "1分/项",
            "v3": "1分/项"
          },
          {
            "v1": "CLB 7 or 8",
            "v2": "3分/项",
            "v3": "3分/项"
          },
          {
            "v1": "CLB 9 or more",
            "v2": "6分/项",
            "v3": "6分/项"
          }
        ]
      },
      {
        "title": "加拿大工作经验 Canadian work experience",
        "_id": 5,
        "k1": "有配偶最高70分",
        "k2": "单身最高80分",
        "list": [{
            "v1": "1 年",
            "v2": "35",
            "v3": "40"
          },
          {
            "v1": "2 年",
            "v2": "46",
            "v3": "53"
          },
          {
            "v1": "3 年",
            "v2": "56",
            "v3": "64"
          },
          {
            "v1": "4 年",
            "v2": "63",
            "v3": "72"
          },
          {
            "v1": "5 年及以上",
            "v2": "70",
            "v3": "80"
          }
        ]
      }
    ]
  },
  {
    "title": "B. 配偶因素 Spouse or common-law partner factors",
    "k1": "有配偶最高 40分",
    "k2": "",
    "children": [{
        "title": "配偶教育 Spouse's or common-law partner’s level of education",
        "_id": 1,
        "k1": "有配偶最高10分",
        "k2": "",
        "list": [{
            "v1": "高中",
            "v2": "2",
            "v3": ""
          },
          {
            "v1": "一年高等教育",
            "v2": "6",
            "v3": ""
          },
          {
            "v1": "二年高等教育",
            "v2": "7",
            "v3": ""
          },
          {
            "v1": "三年及以上高等教育",
            "v2": "8",
            "v3": ""
          },
          {
            "v1": "两个以上高等教育且其中一个为3年制及以上",
            "v2": "9",
            "v3": ""
          },
          {
            "v1": "硕士",
            "v2": "10",
            "v3": ""
          },
          {
            "v1": "博士",
            "v2": "10",
            "v3": ""
          }
        ]
      },
      {
        "title": "配偶语言 Spouse's or common-law partner's official languages proficiency",
        "_id": 2,
        "k1": "有配偶最高20分",
        "k2": "",
        "list": [{
            "v1": "CLB 5 or 6",
            "v2": "1分/项",
            "v3": ""
          },
          {
            "v1": "CLB 7 or 8",
            "v2": "3分/项",
            "v3": ""
          },
          {
            "v1": "CLB 9 or more",
            "v2": "5分/项",
            "v3": ""
          }
        ]
      },
      {
        "title": "配偶加拿大工作经验 Spouse's Canadian work experience",
        "_id": 3,
        "k1": "有配偶最高10分",
        "k2": "",
        "list": [{
            "v1": "1 年",
            "v2": "5",
            "v3": ""
          },
          {
            "v1": "2 年",
            "v2": "7",
            "v3": ""
          },
          {
            "v1": "3 年",
            "v2": "8",
            "v3": ""
          },
          {
            "v1": "4 年",
            "v2": "9",
            "v3": ""
          },
          {
            "v1": "5 年及以上",
            "v2": "10",
            "v3": ""
          }
        ]
      }
    ]
  }, {
    "title": "C. 迁移能力因素 Skill transferability factors",
    "k1": "有配偶最高 100分",
    "k2": "单身最高 100分",
    "children": [{
        "title": "教育水平 Education",
        "_id": 1,
        "k1": "有配偶最高50分",
        "k2": "单身最高50分",
        "list": [{
            "v1": "I. 教育加分基于语言 With good official language proficiency and a post-secondary degree",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "高中学历",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "一年及以上高等教育，同时第一语言整体达到CLB7",
            "v2": "13",
            "v3": "13"
          },
          {
            "v1": "一年及以上高等教育，同时第一语言整体达到CLB9",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "两个以上高等教育且其中一个为3年制及以上，同时第一语言整体达到CLB7",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "两个以上高等教育且其中一个为3年制及以上，同时第一语言整体达到CLB9",
            "v2": "50",
            "v3": "50"
          },
          {
            "v1": "II. 教育加分基于加拿大工作经验 With Canadian work experience and a post-secondary degree",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "高中学历",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "一年及以上高等教育，同时第一语言整体达到CLB7",
            "v2": "13",
            "v3": "13"
          },
          {
            "v1": "一年及以上高等教育，同时第一语言整体达到CLB9",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "两个以上高等教育且其中一个为3年制及以上，同时第一语言整体达到CLB7",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "两个以上高等教育且其中一个为3年制及以上，同时第一语言整体达到CLB9",
            "v2": "50",
            "v3": "50"
          }
        ]
      },
      {
        "title": "工作经验（加拿大境外） Foreign work experience",
        "_id": 2,
        "k1": "有配偶最高50分",
        "k2": "单身最高50分",
        "list": [{
            "v1": "I. 工作加分基于语言 With good official language proficiency and a post-secondary degree",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "无加拿大境外工作经验",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "1-2年加拿大境外工作经验，同时第一语言整体达到CLB9",
            "v2": "13",
            "v3": "13"
          },
          {
            "v1": "1-2年加拿大境外工作经验，同时第一语言整体达到CLB9",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "3年及以上加拿大境外工作经验，同时第一语言整体达到CLB7",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "3年及以上加拿大境外工作经验，同时第一语言整体达到CLB9",
            "v2": "50",
            "v3": "50"
          },
          {
            "v1": "II. 工作加分基于加拿大工作经验 With Canadian work experience and a post-secondary degree",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "无加拿大境外工作经验",
            "v2": "-",
            "v3": "-"
          },
          {
            "v1": "1-2年加拿大境外工作经验，同时至少1年加拿大工作经验",
            "v2": "13",
            "v3": "13"
          },
          {
            "v1": "1-2年加拿大境外工作经验，同时至少2年加拿大工作经验",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "3年及以上加拿大境外工作经验，同时至少1年加拿大工作经验",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "3年及以上加拿大境外工作经验，同时至少2年加拿大工作经验",
            "v2": "50",
            "v3": "50"
          }
        ]
      },
      {
        "title": "加拿大技工职业证书 Certificate of qualification",
        "_id": 3,
        "k1": "有配偶最高50分",
        "k2": "单身最高50分",
        "list": [{
            "v1": "持有加拿大技工 ，同时第一语言语言整体不低于CLB5,且有一项达到CLB7",
            "v2": "25",
            "v3": "25"
          },
          {
            "v1": "持有加拿大技工 ，同时第一语言语言整体不低于CLB7",
            "v2": "50",
            "v3": "50"
          }
        ]
      }
    ]
  }, {
    "title": "D. 其他加分 Additional points",
    "k1": "有配偶最高 600分",
    "k2": "单身最高 600分",
    "children": [{
      "title": "xxxx",
      "_id": 1,
      "k1": "有配偶最高xxxxx分",
      "k2": "单身最高xxxxx分",
      "list": [{
          "v1": "加拿大公民或永居的兄弟姐妹",
          "v2": "15",
          "v3": "15"
        },
        {
          "v1": "法语NCLC7级，同时英语CLB4级及以下",
          "v2": "15",
          "v3": "15"
        },
        {
          "v1": "法语NCLC7级，同时英语CLB5级及以上",
          "v2": "30",
          "v3": "30"
        },
        {
          "v1": "1-2年加拿大高等学历",
          "v2": "15",
          "v3": "15"
        },
        {
          "v1": "3 年及以上加拿大高等教育",
          "v2": "30",
          "v3": "30"
        },
        {
          "v1": "NOC 00 开头高管职业雇佣安排（获得 LMIA 或已经在加拿大工作一年以上）",
          "v2": "200",
          "v3": "200"
        },
        {
          "v1": "",
          "v2": "50",
          "v3": "50"
        },
        {
          "v1": "EE 下省提名",
          "v2": "600",
          "v3": "600"
        }
      ]
    }]
  }

]
