//费用详情
var PAYDIC = {
  "kui": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译、公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "魁省申请费",
      "魁省移民局",
      "主申 785加币<br/>随行配偶及子女（未满22周岁） 168加币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民申请费",
      "加拿大联邦移民局",
      "主申及其配偶：550加币/人<br/>随行子女（未满22周岁） 150加币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民登陆费",
      "加拿大联邦移民局",
      "申请人和配偶：<br/>490加币/人（未婚随行子女不交）",
      "获批登陆前",
      "未登录可退"
    ],
    [
      "第三方费用",
      "移民体检费",
      "指定体检医院",
      "15周岁以上：1,700人民币/人；<br/>15周岁以下：500-1,250人民币/人",
      "申请签证前",
      "不退"
    ]
  ],
  "fsw": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译、公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "学历认证费",
      "学历认证机构",
      "1,600-3,000 人民币/份",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民申请费",
      "加拿大联邦移民局",
      "主申及其配偶：550加币/人<br/>随行子女（未满22周岁）150加币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民登陆费",
      "加拿大联邦移民局",
      "申请人和配偶：<br/>490加币/人（未婚随行子女不交）",
      "获批登陆前",
      "未登录可退"
    ],
    [
      "第三方费用",
      "移民体检费",
      "指定体检医院",
      "15周岁以上：1,700人民币/人；<br/>15周岁以下：500-1,250人民币/人",
      "申请签证前",
      "不退"
    ]
  ],
  "an": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译、公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "学历认证费",
      "学历认证机构",
      "1,600-3,000 人民币/份",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "省提名申请费",
      "安省移民局",
      "1500 加币/家庭",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民申请费",
      "加拿大联邦移民局",
      "主申及其配偶：550加币/人<br/>随行子女（未满22周岁）150加币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民登陆费",
      "加拿大联邦移民局",
      "申请人和配偶：<br/>490加币/人（未婚随行子女不交）",
      "获批登陆前",
      "未登录可退"
    ],
    [
      "第三方费用",
      "移民体检费",
      "指定体检医院",
      "15周岁以上：1,700人民币/人；<br/>15周岁以下：500-1,250人民币/人",
      "申请签证前",
      "不退"
    ]
  ],
  "nb": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译、公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "学历认证费",
      "学历认证机构",
      "1,600-3,000 人民币/份",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "省提名申请费",
      "NB省移民局",
      "250 加币/家庭",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民申请费",
      "加拿大联邦移民局",
      "主申及其配偶：550加币/人<br/>随行子女（未满22周岁） 150加币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民登陆费",
      "加拿大联邦移民局",
      "申请人和配偶：<br/>490加币/人（未婚随行子女不交）",
      "获批登陆前",
      "未登录可退"
    ],
    [
      "第三方费用",
      "移民体检费",
      "指定体检医院",
      "15周岁以上：1,700人民币/人；<br/>15周岁以下：500-1,250人民币/人",
      "申请签证前",
      "不退"
    ]
  ],
  "ns": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译及公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "学历认证费-移民申请用途",
      "学历认证机构",
      "1,600-3,000 人民币/份",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民申请费",
      "加拿大联邦移民局",
      "主申及其配偶：550加币/人<br/>随行子女（未满22周岁）150加币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民登陆费",
      "加拿大联邦移民局",
      "申请人和配偶：<br/>490加币/人（未婚随行子女不交）",
      "获批登陆前",
      "未登录可退"
    ],
    [
      "第三方费用",
      "移民体检费",
      "指定体检医院",
      "15周岁以上：1,700人民币/人；<br/>15周岁以下：500-1,250人民币/人",
      "申请签证前",
      "不退"
    ]
  ],
  "sa": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译、公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "学历认证费-移民申请用途",
      "学历认证机构",
      "1,600-3,000 人民币/份",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "学历认证费-职业认证用途 （如适用）",
      "学历认证机构",
      "1,600-3,000 人民币/份",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "职业认证费（如适用）",
      "职业认证机构",
      "400-500 加币",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "省提名申请费",
      "萨省移民局",
      "300 加币/家庭",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民申请费",
      "加拿大联邦移民局",
      "主申及其配偶：550加币/人<br/>随行子女（未满22周岁）150加币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "移民登陆费",
      "加拿大联邦移民局",
      "申请人和配偶：<br/>490加币/人（未婚随行子女不交）",
      "获批登陆前",
      "未登录可退"
    ],
    [
      "第三方费用",
      "移民体检费",
      "指定体检医院",
      "15周岁以上：1,700人民币/人；<br/>15周岁以下：500-1,250人民币/人",
      "申请签证前",
      "不退"
    ]
  ],
  "_189": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译、公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "职业评估费",
      "职业评估机构",
      "VET职业评估, 一个国内本科学历的情况下1592澳币<br/>ACS评估 500澳币<br/>ACS-RPL评估 550澳币<br/>AIM评估 550澳币<br/>AIQS评估 650澳币 <br/>TRA评估 1000澳币 ",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "申请费",
      "澳洲移民局",
      "主申请人：3670澳币/人<br/>随行配偶：1835澳币/人<br/>随行未满22周岁子女：920澳币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "副申语言费",
      "澳洲移民局",
      "4885澳币/人（配偶有CLB4的语言成绩就不用交语言费）",
      "获批登陆前",
      "不退"
    ],
    [
      "第三方费用",
      "体检费",
      "指定体检医院",
      "主副申：1500人民币/人<br/>子女：700人民币/人",
      "申请签证前后",
      "不退"
    ]
  ],
  "_190": [
    [
      "费用分类",
      "费用项",
      "收费机构",
      "金额",
      "收费时间/阶段",
      "退款标准"
    ],
    [
      "第三方费用",
      "翻译、公证费",
      "相关机构",
      "1,000-3,000 人民币/户",
      "递交申请前支付",
      "不退"
    ],
    [
      "第三方费用",
      "职业评估费",
      "职业评估机构",
      "VET职业评估, 一个国内本科学历的情况下1592澳币<br/>ACS评估 500澳币 <br/>ACS-RPL评估 550澳币 <br/>AIM评估 550澳币 <br/>AIQS评估 650澳币 <br/>TRA评估 1000澳币 ",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "州担保费用",
      "州政府",
      "NSW： 300澳币<br/>QLD： 200澳币<br/>WA： 200澳币<br/>其他州免费",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "申请费",
      "澳洲移民局",
      "主申请人：3670澳币/人<br/>随行配偶：1835澳币/人<br/>随行未满22周岁子女：920澳币/人",
      "递交申请前支付",
      "不退"
    ],
    [
      "官方费用",
      "副申语言费",
      "澳洲移民局",
      "4885澳币/人（配偶有CLB4的语言成绩就不用交语言费）",
      "获批登陆前",
      "不退"
    ],
    [
      "第三方费用",
      "体检费",
      "指定体检医院",
      "主副申：1500人民币/人<br/>子女：700人民币/人",
      "申请签证前后",
      "不退"
    ]
  ]
};

var DOCLIST = {
  "kui_1": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民信息表",
      null, -1, -1, -1
    ],
    [
      "出生公证",
      "可能需要先去公证处拿单子，去户籍所在地派出所/或者人才档案保管处盖章，办理前先咨询当地公证处(北京上海都需要先取单子)", -1, -1
    ],
    [
      "出生医学证明公证",
      "90年后出生的子女需要提供出生医学证明的公证（公证里带有出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "结婚证公证",
      "公证主申请人为持证人的那份", -1, -1
    ],
    [
      "同居伴侣相关证明文件",
      "提供至少1年的同居证明，证明文件可以是共同财产声明，电费，燃气费，电话单，网费等", -1, -1
    ],
    [
      "学位学历公证",
      "高中，大中专毕业证，本科毕业证，本科学位证，硕士毕业证，硕士学位证，博士毕业证，博士学位证（如果学校能在证书复印件与翻译件上盖章，就不必公证了）", -1, -1
    ],
    [
      "成绩单中英文盖章件",
      "中专成绩单中英文盖章件，大专成绩单中英文盖章件，本科成绩单中英文盖章件，硕士成绩单中英文盖章件（如果盖章不方便，提供中英文公证件也可以）", -1, -1
    ],
    [
      "全套申请表签字",
      "填写完整后，打印并签字扫描", -1, -1
    ],
    [
      "推荐信",
      "近5年工作的推荐信。", -1, -1
    ],
    [
      "推荐人名片",
      "提供推荐人名片，1张/人，尽量是中英文的，没有就算了，不做强制要求。",
      "非必须",
      "非必须"
    ],
    [
      "个人所得税证明及社保原件扫描件",
      "提供近5年工作的社保证明和个税证明原件扫描件（不能提供满5年的话，需要做解释 ）", -1, -1
    ],
    [
      "存款证明扫描件",
      "银行开具，冻结3个月，可在夫妻名下，总数不低于5万人民币，主申名下不低于3万人民币，多多益善，见指南。注：其他资料准备齐全后再开具存款证明", -1, -1
    ],
    [
      "CSQ申请费",
      "自2018/1/1起，主申 785加币，副申和子女各168加币.注：2016年1月实施在线系统，信用卡在线支付申请费 （信用卡要求有外币功能，visa 或者master均可）", -1, -1, -1
    ],
    [
      "护照首页扫描件",
      "当前护照有效期不能短于2年。当前护照/老护照，扫描带有照片和信息的首页，加拿大签证页（当前住在国外的，需要提供目前居住国家的签证扫描）有学习许可工作许可的也需要提供扫描件", -1, -1, -1
    ],
    [
      "移民照片电子版",
      "3.5×4.5cm的加拿大移民照片，近期的，白底（照片头像下巴到额头的尺寸是25mm到30mm之间）具体细节要求参考指南", -1, -1, -1
    ]
  ],
  "kui_2": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "全套申请表",
      "联邦阶段申请表", -1, -1
    ],
    [
      "出生公证",
      "可能需要先去公证处拿单子，去户籍所在地派出所/或者人才档案保管处盖章，办理前先咨询当地公证处(北京上海都需要先取单子)。", -1, -1
    ],
    [
      "出生医学证明公证",
      "90年后出生的子女需要提供出生医学证明的公证（公证里带有出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "户口公证",
      "全家，户口首页+主申、副申、子女的户口页。如果申请人全家的户口在一起，只公证一本就可以了。", -1, -1, -1
    ],
    [
      "无犯罪证明公证",
      "18周岁以上的申请人需要。可能需要先去公证处拿单子，去户籍所在地管辖派出所/人才档案保管处开具证明然后公证办理前先咨询当地公证处 (北京上海都需要先取单子)1年的有效期。", -1, -1,
      "如适用"
    ],
    [
      "结婚证公证",
      "公证主申请为持证人的那份", -1
    ],
    [
      "未婚公证",
      "单身申请人需要提供", -1
    ],
    [
      "身份证公证件",
      "持身份证到公证处进行身份证公证，如果当地公证处不能做身份证公证，提供复印件和翻译件", -1, -1,
      "如适用"
    ],
    [
      "护照复印件",
      "当前护照复印件，复印带有照片和信息的首页，签证页", -1, -1, -1
    ],
    [
      "移民照片",
      "5.0*7.0cm的加拿大移民照片，4张，近6个月内的照片（白底，照片头像，下巴到额头的尺寸是31mm到36mm之间。注明:拍照时不能漏牙齿，自然表情即可）", -1, -1, -1
    ],
    [
      "申请费收据或者费用表格签字",
      "主申550加元+副申550加元+孩子150加元。可以在线信用卡提前支付好，打印收据。", -1, -1, -1
    ],
    [
      "CSQ通过函原件",
      "CSQ上写着Certificatde selection du Quebec, 右下角标注2-Immigration的那份", -1
    ]
  ],
  "fsw": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民信息表",
      null, -1, -1, -1
    ],
    [
      "护照扫描件",
      "当前护照有效期不能短于半年。扫描带有照片和信息的首页，加拿大签证页（当前住在国外的，需要提供目前居住国家的签证扫描）有学习许可工作许可的也需要提供扫描件", -1, -1, -1
    ],
    [
      "身份证扫描件",
      "正反面扫描", -1, -1
    ],
    [
      "出生医学证明公证扫描件",
      "将孩子的出生医学证明公证（公证书里附上出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "结婚证公证彩色扫描件",
      "公证主申请人为持证人的那份结婚证 ", -1
    ],
    [
      "户口本公证彩色扫描件",
      "公证户主页+主申请本人页+副申请页+子女页 （如果申请人全家的户口在一起，只公证一本就可以了）备注：先检查下户口本信息是否需要更新，教育程度、服务处所、职位等等与申请信息是否一致等", -1, -1, -1
    ],
    [
      "移民照片电子版",
      "3.5X4.5cm的加拿大移民照片，近6个月内的照片（白底，照片头像，下巴到额头的尺寸是31mm到36mm之间。（注明:拍照时不能漏牙齿，自然表情即可）", -1, -1, -1
    ],
    [
      "学历认证报告扫描件",
      "加拿大ECA认证报告扫描件  ", -1, -1
    ],
    [
      "毕业证和学位证公证/盖章件",
      "最高全日制学历的毕业证&学位证公证（若学校能在证书复印件与翻译件上盖章，则不必去公证）", -1, -1
    ],
    [
      "成绩单公证/盖章件",
      "最高全日制学历的成绩单中英文盖章件，如果学校不能在英文上盖章，中文成绩单需要做公证", -1, -1
    ],
    [
      "推荐信签字扫描件",
      "近十年工作的推荐信，打印在单位信头纸上，信头纸要求显示公司名称以及联系方式  ", -1, -1
    ],
    [
      "工作辅助材料扫描件",
      "提供近十年（至少能够覆盖加分段的工作履历）工作辅助材料：个税，社保，工资单，合同，在职/离职收入证明 ", -1, -1
    ],
    [
      "存款证明原件扫描件",
      "注：其他资料准备齐全后再开具资金证明，一般一个人不低于8万，夫妻2人不低于10万，一家三口不低于12万人民币，主副申名下均可，最好存半年定期，能冻结更好 ", -1,
      "非必须"
    ],
    [
      "银行流水扫描件",
      "需要提供近6个月的银行流水，最好能办理处中英文对照版本，没有英文，可询问银行是否能开具存款发生额证明，开具中英文对照的", -1,
      "非必须"
    ],
    [
      "中国无犯罪公证扫描件",
      "可能需要先去公证处拿单子，去户籍所在地管辖派出所/人才档案保管处开具证明，然后公证办理前先咨询当地公证处 (北京上海都需要先取单子) 公证1年的有效期。", -1, -1
    ],
    [
      "体检凭证扫描件",
      "在递交EE签证申请之前，申请人需要进行预体检 upfront medical exam，体检后，医院会给申请人一个medical information sheet把这个扫描过来，指定体检医院列表：http://www.cic.gc.ca/pp-md/pp-list.aspx", -1, -1, -1
    ],
    [
      "申请费&登陆费收据",
      "申请费和登陆费可以一起支付，以后就不用单独支付了。", -1, -1, -1
    ]
  ],
  "an": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民信息表",
      null, -1, -1, -1
    ],
    [
      "安省NOI意向信",
      "安省发送到EE系统的Notification of Interest letter（NOI letter里面必须包括发送日期）", -1
    ],
    [
      "整本护照扫描件",
      "当前护照整本扫描件，有效期至少两年（如果有效期不足两年，需要更新护照；如果签发不足两年，需同时提供旧护照整本扫描件），有学习许可、工作许可的也需要提供扫描件", -1, -1, -1
    ],
    [
      "结婚证公证扫描件",
      "公证主申请人为持证人的那份结婚证 ", -1
    ],
    [
      "出生公证扫描件",
      "可能需要先去公证处拿单子，去户籍所在地派出所/或者人才档案保管处盖章，办理前先咨询当地公证处(北京上海等一线城市都需要先到公证处取单子) ", -1, -1
    ],
    [
      "出生医学证明扫描件",
      "将孩子的出生医学证明公证（公证书里附上出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "学历认证报告扫描件",
      "加拿大ECA认证报告扫描件  ", -1
    ],
    [
      "毕业证和学位证公证/学校盖章件",
      "最高全日制学历的毕业证&学位证公证（若学校能在证书复印件与翻译件上盖章，则不必去公证）", -1
    ],
    [
      "成绩单学校盖章件",
      "最高全日制学历的成绩单中英文盖章件，如果学校不能在英文上盖章，中文成绩单需要做公证", -1
    ],
    [
      "雅思或TEF成绩单扫描件",
      "递交申请的时候认可两年内考试成绩", -1,
      "如适用"
    ],
    [
      "个人简历",
      "近10年工作的简历", -1
    ],
    [
      "推荐信签字扫描件",
      "近10年工作的推荐信", -1
    ],
    [
      "工作辅助证明材料公证扫描件",
      "工资单、个税、社保、聘用合同公证扫描件（中文的需要做公证）", -1
    ],
    [
      "资金证明原件扫描件",
      "存款证明建议是活期的，安省会看这笔资金是否能带过去", -1
    ],
    [
      "银行流水扫描件",
      "要求近6个月银行流水要一直涵盖最低的金额（一个申请人等值8万人民币，2个申请人10万，3个申请人12万），有不随同家庭成员时也按照这个标准提供", -1
    ],
    [
      "电子版照片",
      "近期白底3.5×4.5cm的加拿大移民照片 （照片脸部居中，下巴到头顶的尺寸是31mm到36mm，300dpi或413像素×531像素或更大）<br/>文件命名格式：“John Smith passport photo. jpg”.", -1
    ],
    [
      "安省居住意向信",
      "陈述自己与安大略的关联性（是否曾经去过安大略旅游，是否有亲属或朋友在安大略定居）；如果没有任何与安大略的关联性，可以写一个类似于新省的定居计划，阐述一下移居过去之后的生活以及工作打算，为了每个申请人有个性化的居住意向信，请您按照附件样本撰写，然后发我们润色确认  ", -1
    ]
  ],
  "nb": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民申请表",
      null, -1
    ],
    [
      "护照整本彩色复印件",
      "提供护照整本复印件，最好是彩色复印件（如果当前居住其它国家超过一年，请提供在该国家合法居住证明）  ", -1, -1, -1
    ],
    [
      "结婚证公证复印件",
      "公证主申请人为持证人的那份结婚证 ", -1
    ],
    [
      "身份证复印件",
      "身份证正反面复印在同一个页面 ", -1, -1,
      "如适用"
    ],
    [
      "出生公证复印件",
      "可能需要先去公证处拿单子，去户籍所在地派出所/或者人才档案保管处盖章，办理前先咨询当地公证处(北京上海等一线城市都需要先到公证处取单子) ", -1, -1
    ],
    [
      "出生医学证明公证复印件",
      "将孩子的出生医学证明公证（公证书里附上出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "户口本公证复印件",
      "户口本首页+主申请户口页公证，如果全家人在一个户口本上公证一本即可 ", -1, -1, -1
    ],
    [
      "移民照片",
      "3.5X4.5cm的加拿大移民照片，近6个月内的照片（白底，照片头像，下巴到额头的尺寸是31mm到36mm之间。照片背面标明申请人姓名、出生日期以及拍照日期（注明:拍照时不能漏牙齿，自然表情即可）", -1, -1, -1
    ],
    [
      "加拿大对等学历认证原件",
      "WES申请系统需要添加recipient 发送给NBPNP ", -1
    ],
    [
      "毕业证和学位证公证/学校盖章件",
      "最高全日制学历的毕业证&学位证公证（若学校能在证书复印件与翻译件上盖章，则不必去公证）", -1
    ],
    [
      "成绩单学校盖章件",
      "最高全日制学历的成绩单中英文盖章件，如果学校不能在英文上盖章，中文成绩单需要做公证", -1
    ],
    [
      "雅思或TEF成绩单原件",
      "G类雅思或TEF成绩单原件（递交申请时候认可两年内考试成绩）", -1,
      "如适用"
    ],
    [
      "推荐信签字原件",
      "提供近10年工作的推荐信签字原件（需要打印在单位信头纸上）", -1
    ],
    [
      "工作辅助证明文件",
      "提供劳动合同复印件、工资单复印件、个人简历", -1
    ],
    [
      "全套申请表签字原件",
      "NB申请表填写并打印签字 ", -1
    ],
    [
      "资金证明原件",
      "1.银行存款证明，最好存半年定期<br/>2.最近6个月的银行活期流水原件<br/>注：其他资料准备齐全后再开具资金证明，一般一个人不低于8万，夫妻2人不低于10万，一家三口不低于12万人民币", -1
    ],
    [
      "离婚证&离婚协议公证复印件",
      "如果主副申请曾离过婚，需要提供以往的离婚证&离婚协议公证件 ",
      "如适用",
      "如适用"
    ],
    [
      "曾用名公证复印件",
      "检查户口本确认是否显示曾用名，有的话拿着户口本去做曾用名公证",
      "如适用",
      "如适用",
      "如适用"
    ],
    [
      "不随同父亲/母亲同意声明公证",
      "如果子女的亲生父亲或者母亲不随同移民，需要出具同意声明公证，将IMM5604表格做公证，附上不随同父亲或者母亲的身份证复印件并签名",
      null,
      "如适用"
    ],
    [
      "NB直系亲属文件",
      "1.PR卡复印件、移民纸复印件、公民卡复印件<br/>2.亲属关系证明文件，比如出生公证，结婚公证<br/>3.居住证明材料：租房合同、NOA税单、雇佣证明、水电费缴费单、银行证明 ",
      "如适用",
      "如适用"
    ],
    [
      "持有NB工作offer文件",
      "加拿大雇主证明信原件，如果当前在加拿大工作，请出具工作许可复印件 ",
      "如适用",
      "如适用"
    ],
    [
      "NB省学历文件",
      "学历证书复印件，成绩单密封件",
      "如适用",
      "如适用"
    ]
  ],
  "ns": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民信息表",
      null, -1, -1, -1
    ],
    [
      "护照首页及加拿大签证页扫描件",
      "当前护照有效期不能短于2年。当前护照/老护照，扫描带有照片和信息的首页，加拿大签证页（当前住在国外的，需要提供目前居住国家的签证扫描）有学习许可工作许可的也需要提供扫描件", -1, -1, -1
    ],
    [
      "结婚证公证扫描件",
      "公证主申请人为持证人的那份结婚证 ", -1
    ],
    [
      "出生医学证明公证扫描件",
      "将孩子的出生医学证明公证（公证书里附上出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "毕业证和学位证公证/学校盖章件",
      "最高全日制学历的毕业证&学位证公证（若学校能在证书复印件与翻译件上盖章，则不必去公证）", -1
    ],
    [
      "成绩单学校盖章件",
      "最高全日制学历的成绩单中英文盖章件，如果学校不能在英文上盖章，中文成绩单需要做公证", -1
    ],
    [
      "加拿大对等学历认证件扫描件",
      "主申请最高学历做WES认证，请尽快提供学历证书和成绩单彩色扫描件（WES认证周期是2-3个月，需要尽快申请）", -1
    ],
    [
      "雅思或TEF成绩单扫描件",
      "递交申请时候认可两年内考试成绩", -1,
      "如适用"
    ],
    [
      "推荐信签字扫描件",
      "近6年工作的推荐信", -1
    ],
    [
      "工作辅助证明文件扫描件",
      "近6年工作的工资单、税单、社保保险证明、合同、公积金等", -1
    ],
    [
      "NS定居计划",
      "关于定居NS后的生活以及工作打算", -1
    ],
    [
      "资金证明原件扫描件",
      "1.最近三个月活期流水扫描件，余额充足<br/>2.定期存款证明扫描件<br/>3.理财产品证明扫描件<br/>以上资金可以任何一种形式都可以，可以几种资金形式凑在一起，只要资金总额符合要求。<br/>注：其他资料准备齐全后再开具资金证明，一般一个人不低于8万，夫妻2人不低于10万，一家三口不低于12万人民币 ", -1
    ]
  ],
  "sa": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民信息表",
      null, -1, -1, -1
    ],
    [
      "护照扫描件",
      "当前护照有效期不能短于2年。当前护照/老护照，扫描带有照片和信息的首页，加拿大签证页（当前住在国外的，需要提供目前居住国家的签证扫描）有学习许可工作许可的也需要提供扫描件", -1, -1, -1
    ],
    [
      "结婚证公证扫描件",
      "公证主申请人为持证人的那份结婚证 ", -1, -1
    ],
    [
      "出生公证扫描件",
      "可能需要先去公证处拿单子，去户籍所在地派出所/或者人才档案保管处盖章，办理前先咨询当地公证处(北京上海等一线城市都需要先到公证处取单子) ", -1, -1
    ],
    [
      "出生医学证明扫描件",
      "将孩子的出生医学证明公证（公证书里附上出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "毕业证和学位证公证/学校盖章件",
      "最高全日制学历的毕业证&学位证公证（若学校能在证书复印件与翻译件上盖章，则不必去公证）", -1
    ],
    [
      "成绩单学校公证/学校盖章件",
      "最高全日制学历的成绩单中英文盖章件，如果学校不能在英文上盖章，中文成绩单需要做公证", -1
    ],
    [
      "学历认证报告扫描件",
      "加拿大ECA认证报告扫描件  ", -1
    ],
    [
      "雅思或TEF成绩单扫描件",
      "有效期两年内的成绩单", -1,
      "如适用"
    ],
    [
      "推荐信签字扫描件",
      "近十年工作的推荐信，打印在单位信头纸上，信头纸要求显示公司名称以及联系方式  ", -1
    ],
    [
      "全套申请表扫描件",
      "萨省申请表和联邦申请都要填写并打印签字，一起上传在线系统", -1, -1
    ],
    [
      "资金证明原件扫描件",
      "1.递交申请前三个月活期流水余额持续满足最低资金要求 <br/>2.定期存款证明及最近三个月的活期流水<br/>3.股票市值单以及最近三个月的交易记录<br/>4.购买国债证明及最近三个月的活期流水<br/>5.现金价值寿险保单及最近三个月的活期流水<br/>以上资金可以任何一种形式都可以，可以几种资金形式凑在一起，只要资金总额符合要求。<br/>注：其他资料准备齐全后再开具资金证明，一般一个人不低于8万，夫妻2人不低于10万，一家三口不低于12万人民币，递交申请前三个月就必须满足最低要求，否则会被拒，主副申名下均可，有转出记录的提供转出卡的流水证明", -1,
      "如适用"
    ]
  ],
  "_189": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民信息表",
      null, -1, -1, -1
    ],
    [
      "护照扫描件",
      "护照首页、签证页、签字尾页", -1, -1, -1
    ],
    [
      "结婚证公证彩色扫描件",
      "公证主申请人为持证人的那份结婚证 ", -1, -1
    ],
    [
      "身份证扫描件",
      "正反面彩色扫描", -1, -1,
      "如适用"
    ],
    [
      "出生公证彩色扫描件",
      "可能需要先去公证处拿单子，去户籍所在地派出所/或者人才档案保管处盖章，办理前先咨询当地公证处(北京上海等一线城市都需要先到公证处取单子) ", -1, -1
    ],
    [
      "出生医学证明彩色扫描件",
      "将孩子的出生医学证明公证（公证书里附上出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "户口本公证彩色扫描件",
      "户口本首页+主申请户口页公证，如果全家人在一个户口本上公证一本即可 ", -1, -1, -1
    ],
    [
      "移民照片",
      "3.5cm*4.5cm，近期的（6个月内），彩照，纯白底色-可以是数码相机拍摄的电子版（照片头像，下巴到额头的尺寸是25mm到30mm之间）", -1, -1, -1
    ],
    [
      "职业评估报告彩色扫描件",
      "必须在有效期内", -1,
      "如适用"
    ],
    [
      "毕业证和学位证公证/学校盖章件",
      "最高全日制学历的毕业证&学位证公证（若学校能在证书复印件与翻译件上盖章，则不必去公证）", -1
    ],
    [
      "成绩单学校盖章件",
      "最高全日制学历的成绩单中英文盖章件，如果学校不能在英文上盖章，中文成绩单需要做公证", -1
    ],
    [
      "学位证教育部认证件",
      "本科学位证、硕士学位证、博士学位证教育部认证",
      "非必须"
    ],
    [
      "语言成绩单扫描件",
      "近三年内的雅思或PTE成绩单彩色扫描件（副申有合格的语言成绩不需要支付语言费；已满16周岁的子女同副申）", -1,
      "如适用",
      "如适用"
    ],
    [
      "推荐信签字彩色扫描件",
      "近8/5/3年内的雇主推荐信", -1
    ],
    [
      "简历",
      "近8/5/3年内工作的简历", -1
    ],
    [
      "工作证明材料扫描件",
      "近8/5/3年工作的合同、工资单、个税证明、社保证明", -1
    ],
    [
      "全套申请表签字扫描件",
      "80表、1221表", -1, -1,
      "如适用"
    ],
    [
      "国内外无犯罪公证扫描件",
      "去户籍所在地管辖派出所办理无犯罪证明然后公证（有有效期，可以等其他材料办好之后再去开具）", -1, -1,
      "如适用"
    ],
    [
      "国外无犯罪证明扫描件",
      "任何16周岁后并且10年内累计居住超过1年的国家都需要提供无犯罪证明", -1, -1,
      "如适用"
    ]
  ],
  "_190": [
    [
      "材料",
      "说明",
      "主申",
      "副申",
      "子女"
    ],
    [
      "移民信息表",
      null, -1, -1, -1
    ],
    [
      "护照扫描件",
      "护照首页、签证页、签字尾页", -1, -1, -1
    ],
    [
      "结婚证公证彩色扫描件",
      "公证主申请人为持证人的那份结婚证 ", -1, -1
    ],
    [
      "身份证扫描件",
      "正反面彩色扫描", -1, -1,
      "如适用"
    ],
    [
      "出生公证彩色扫描件",
      "可能需要先去公证处拿单子，去户籍所在地派出所/或者人才档案保管处盖章，办理前先咨询当地公证处(北京上海等一线城市都需要先到公证处取单子) ", -1, -1
    ],
    [
      "出生医学证明彩色扫描件",
      "将孩子的出生医学证明公证（公证书里附上出生医学证明的复印件），不是普通的出生公证",
      null,
      null, -1
    ],
    [
      "户口本公证彩色扫描件",
      "户口本首页+主申请户口页公证，如果全家人在一个户口本上公证一本即可 ", -1, -1, -1
    ],
    [
      "移民照片",
      "3.5cm*4.5cm，近期的（6个月内），彩照，纯白底色-可以是数码相机拍摄的电子版（照片头像，下巴到额头的尺寸是25mm到30mm之间）", -1, -1, -1
    ],
    [
      "职业评估报告彩色扫描件",
      "必须在有效期内", -1,
      "如适用"
    ],
    [
      "毕业证和学位证公证/学校盖章件",
      "最高全日制学历的毕业证&学位证公证（若学校能在证书复印件与翻译件上盖章，则不必去公证）", -1
    ],
    [
      "成绩单学校盖章件",
      "最高全日制学历的成绩单中英文盖章件，如果学校不能在英文上盖章，中文成绩单需要做公证", -1
    ],
    [
      "学位证教育部认证件",
      "本科学位证、硕士学位证、博士学位证教育部认证",
      "非必须"
    ],
    [
      "语言成绩单扫描件",
      "近三年内的雅思或PTE成绩单彩色扫描件（副申有合格的语言成绩不需要支付语言费；已满18周岁的子女同副申）", -1,
      "如适用",
      "如适用"
    ],
    [
      "推荐信签字彩色扫描件",
      "近8/5/3年内的雇主推荐信", -1
    ],
    [
      "简历",
      "近8/5/3年内工作的简历", -1
    ],
    [
      "工作证明材料扫描件",
      "近8/5/3年工作的合同、工资单、个税证明、社保证明", -1
    ],
    [
      "全套申请表签字扫描件",
      "80表、1221表", -1, -1,
      "如适用"
    ],
    [
      "国内外无犯罪公证扫描件",
      "去户籍所在地管辖派出所办理无犯罪证明然后公证（有有效期，可以等其他材料办好之后再去开具）", -1, -1,
      "如适用"
    ],
    [
      "国外无犯罪证明扫描件",
      "任何16周岁后并且10年内累计居住超过1年的国家都需要提供无犯罪证明", -1, -1,
      "如适用"
    ],
    [
      "曾用名公证",
      "检查户口本确认是否显示曾用名，有的话拿着户口本去做曾用名公证",
      "如适用",
      "如适用",
      "如适用"
    ],
    [
      "学习证明相关文件",
      "已满18周岁子女，需要提供学习证明，并填写47A表",
      null,
      null,
      "如适用"
    ]
  ],
}

var DURATION = {
  "kui": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "1~2周",
      "主要材料请参见“材料清单”页。"
    ],
    [
      "抢名额",
      "每年开放1-2次",
      "配额情况请参见“政策解读”页。"
    ],
    [
      "魁省处理周期",
      "24-50个月",
      "自抢到名额开始计算。"
    ],
    [
      "联邦处理周期",
      "12个月左右",
      "自递交联邦移民签证申请材料开始计算。"
    ]
  ],
  "fsw": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "3个月左右",
      "学历认证周期较长；主要材料请参见“材料清单”页。"
    ],
    [
      "获得ITA邀请",
      "每月邀请1-2次",
      "邀请情况请参见“政策解读”页。"
    ],
    [
      "联邦处理周期",
      "6个月左右",
      "自递交联邦移民签证申请材料开始计算"
    ],
    [
      "官方费用",
      "移民登陆费",
      "加拿大联邦移民局"
    ],
    [
      "第三方费用",
      "移民体检费",
      "指定体检医院"
    ]
  ],
  "an": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "3个月左右",
      "学历认证周期较长；主要材料请参见“材料清单”页。"
    ],
    [
      "安省意向信",
      "不定期",
      "配额情况请参见“政策解读”页。"
    ],
    [
      "省提名处理周期",
      "1-6个月",
      "自抢到名额开始计算"
    ],
    [
      "联邦处理周期",
      "6个月左右",
      "自递交联邦移民签证申请材料开始计算"
    ]
  ],
  "nb": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "3个月左右",
      "学历认证周期较长；主要材料请参见“材料清单”页。"
    ],
    [
      "抢名额",
      "不定期",
      "配额情况请参见“政策解读”页。"
    ],
    [
      "省提名处理周期",
      "1-6个月",
      "自抢到名额开始计算"
    ],
    [
      "联邦处理周期",
      "6个月左右",
      "自递交联邦移民签证申请材料开始计算"
    ]
  ],
  "ns": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "3个月左右",
      "学历认证周期较长；主要材料请参见“材料清单”页。"
    ],
    [
      "抢名额",
      "每年4次左右",
      "配额情况请参见“政策解读”页。"
    ],
    [
      "省提名处理周期",
      "1-3个月",
      "自抢到名额开始计算。"
    ],
    [
      "联邦处理周期",
      "6个月左右",
      "自递交联邦移民签证申请材料开始计算。"
    ]
  ],
  "sa_oid": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "12个月左右",
      "职业认证周期较长；主要材料请参见“材料清单”页。"
    ],
    [
      "抢名额",
      "每1-2个月左右开放1次",
      "配额情况请参见“政策解读”页。"
    ],
    [
      "省提名处理周期",
      "3-6个月",
      "自抢到名额开始计算"
    ],
    [
      "联邦处理周期",
      "12个月左右",
      "自递交联邦移民签证申请材料开始计算"
    ]
  ],
  "sa_ee": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "12个月左右",
      "职业认证周期较长；主要材料请参见“材料清单”页。"
    ],
    [
      "抢名额",
      "每1-2个月左右开放1次",
      "配额情况请参见“政策解读”页。"
    ],
    [
      "省提名处理周期",
      "3-6个月",
      "自抢到名额开始计算"
    ],
    [
      "联邦处理周期",
      "6个月左右",
      "自递交联邦移民签证申请材料开始计算"
    ]
  ],
  "_189": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "3-6个月",
      "职业评估周期较长，不同机构处理速度不同，部分可加急；主要材料请参见“材料清单”页。"
    ],
    [
      "递交EOI获得邀请",
      "每个月2次左右",
      "通常在第2周和第4周的周三。"
    ],
    [
      "签证申请处理周期",
      "6-10个月",
      "自EOI获得邀请并递交签证申请之日起开始计算。"
    ]
  ],
  "_190": [
    [
      "环节",
      "周期",
      "说明"
    ],
    [
      "准备移民材料（不含语言考试）",
      "3-6个月",
      "职业评估周期较长，不同机构处理速度不同，部分可加急；主要材料请参见“材料清单”页。"
    ],
    [
      "递交州担保通过",
      "不确定",
      "有的州可以直接申请，有的州需要等待州邀请后，再递交州担保申请。"
    ],
    [
      "EOI获得邀请",
      "每个月2次左右",
      "通常在第2周和第4周的周三。"
    ],
    [
      "签证申请处理周期",
      "6-10个月",
      "自EOI获得邀请并递交签证申请之日起开始计算。"
    ]
  ]
}

$(document.body).append(
  '<script type="text/x-template" id="detail-pay-template">' +
  '<ul class="table-ul">' +
  '  <li :class="item[6]" v-for="(item,index) in ds">' +
  '    <div class="col-sm-1">{{item[0]}}</div>' +
  '    <div class="col-sm-2 pl-5">{{item[1]}}</div>' +
  '    <div class="col-sm-2">{{item[2]}}</div>' +
  '    <div class="col-sm-4" v-html="item[3]"></div>' +
  '    <div class="col-sm-2">{{item[4]}}</div>' +
  '    <div class="col-sm-1">{{item[5]}}</div>' +
  '  </li>' +
  '</ul>' +
  '</script>');

$(document.body).append(
  '<script type="text/x-template" id="detail-doc-template">' +
  '<ul class="table-ul">' +
  '  <li :class="item[item.length-1]" v-for="(item,index) in ds">' +
  '    <div class="col-sm-3">{{item[0]}}</div>' +
  '    <div class="col-sm-6 pr-30" v-html="item[1]"></div>' +
  '    <div class="col-sm-1 text-center"><span v-if="index==0">{{item[2]}}</span><i v-if="item[2]==-1" class="fa fa-check-square-o"></i></div>' +
  '    <div class="col-sm-1 text-center"><span v-if="index==0">{{item[3]}}</span><i v-if="item[3]==-1" class="fa fa-check-square-o"></i></div>' +
  '    <div class="col-sm-1 text-center"><span v-if="index==0">{{item[4]}}</span><i v-if="item[4]==-1" class="fa fa-check-square-o"></i></div>' +
  '  </li>' +
  '</ul>' +
  '</script>');

$(document.body).append(
  '<script type="text/x-template" id="detail-dura-template">' +
  '<ul class="table-ul">' +
  '  <li :class="item[3]" v-for="(item,index) in ds">' +
  '    <div class="col-sm-3">{{item[0]}}</div>' +
  '    <div class="col-sm-3">{{item[1]}}</div>' +
  '    <div class="col-sm-6">{{item[2]}}</div>' +
  '  </li>' +
  '</ul>' +
  '</script>');


function _class(ds, pi) {
  for (var i = 0; i < ds.length; i++) {
    var len = pi || ds[i].length;
    ds[i][len] = "";
    if (i == 0) {
      ds[i][len] += "table-title";
    }
    if (i % 2 == 0) {
      ds[i][len] += " bg-gray";
    }
  }
}


Vue.component('detail-pay', {
  props: ["ds"],
  template: '#detail-pay-template',
  data: function() {
    _class(this.ds, 6);
    return {
      "ds": this.ds || []
    };
  },
  mounted: function() {},
  methods: {}
});

Vue.component('detail-doc', {
  props: ["ds"],
  template: '#detail-doc-template',
  data: function() {
    _class(this.ds);
    return {
      "ds": this.ds || []
    };
  },
  mounted: function() {},
  methods: {}
});

Vue.component('detail-dura', {
  props: ["ds"],
  template: '#detail-dura-template',
  data: function() {
    _class(this.ds, 3);
    return {
      "ds": this.ds || []
    };
  },
  mounted: function() {},
  methods: {}
});
